backend/app/controllers/profile_controller.rb

  def create
    co_application_credit_rating = CreditRating.where(name: params[:co_application_credit_rating]).first
    if !co_application_credit_rating.blank?
      co_application_credit_rating = co_application_credit_rating.id
    end

    @profile = Profile.create!(
      age: params[:age],
      current_residence_years: params[:current_residence_years],
      is_married: params[:is_married],
      number_of_dependants: params[:number_of_dependants],
      graduated: params[:graduated],
      self_employed: params[:self_employed],
      years_of_job_stability: params[:years_of_job_stability],
      years_of_salary: params[:years_of_salary],
      credit_rating: CreditRating.where(name: params[:credit_rating]).first.id,
      co_application_age: params[:co_application_age],
      co_application_years_of_job_stability: params[:co_application_years_of_job_stability],
      co_application_yearly_salary: params[:co_application_yearly_salary],
      co_application_credit_rating: co_application_credit_rating,
      loan_term_in_years: params[:loan_term_in_years],
      loan_amount: params[:loan_amount],
      property_total_cost: params[:property_total_cost],
      area_classification: AreaClassification.where(name: params[:area_classification]).first.id,
      approved: false
    )

    @profile.approved = validate(@profile)
    @profile.save
---
SELECT  "credit_ratings".* FROM "credit_ratings" WHERE "credit_ratings"."name" = $1 ORDER BY "credit_ratings"."id" ASC LIMIT $2  [["name", "null"], ["LIMIT", 1]]
INSERT INTO "profiles" ("age", "current_residence_years", "is_married", "number_of_dependants", "graduated", "self_employed", "years_of_job_stability", "years_of_salary", "credit_rating", "co_application_age", "co_application_years_of_job_stability", "co_application_yearly_salary", "loan_term_in_years", "loan_amount", "property_total_cost", "area_classification", "approved", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19) RETURNING "id"
SELECT  "area_classifications".* FROM "area_classifications" WHERE "area_classifications"."name" = $1 ORDER BY "area_classifications"."id" ASC LIMIT $2  [["name", "CLASS_A"], ["LIMIT", 1]]
SELECT  "credit_ratings".* FROM "credit_ratings" WHERE "credit_ratings"."name" = $1 ORDER BY "credit_ratings"."id" ASC LIMIT $2  [["name", "AAAA"], ["LIMIT", 1]]
UPDATE "profiles" SET "approved" = $1, "updated_at" = $2 WHERE "profiles"."id" = $3  [["approved", true], ["updated_at", "2019-11-02 17:25:11.624854"], ["id", "0bb0b499-8d20-4bf5-99c3-f252cceffcbf"]]

  def list
    @profile = Profile.all
---
SELECT "profiles".* FROM "profiles"

  def validate(profile)
    profile_credit = CreditRating.find(profile.credit_rating)
    if !profile_credit.blank?
      profile_credit = profile_credit.name
    end

    if profile.co_application_credit_rating != nil
      co_credit = CreditRating.find(profile.co_application_credit_rating)
      if !co_credit.blank?
        co_credit = co_credit.name
      end
    else
      co_credit = nil
    end

    area_classification = AreaClassification.find(profile.area_classification)
    if !area_classification.blank?
---
SELECT  "credit_ratings".* FROM "credit_ratings" WHERE "credit_ratings"."id" = $1 LIMIT $2  [["id", "95699cd3-6772-4da6-bdce-d8e950ebef71"], ["LIMIT", 1]]
SELECT  "area_classifications".* FROM "area_classifications" WHERE "area_classifications"."id" = $1 LIMIT $2  [["id", "ade12b9a-644f-4f38-8f48-d07c97a697d8"], ["LIMIT", 1]]